CyberCastle/PIC32-MCU-Compiler/pic32-part-support/proc/32MX275F256D/p32mx275f256d.h
extern volatile __CNSTATBbits_t CNSTATBbits __asm__ ("CNSTATB") __attribute__((section("sfrs"), address(0xBF886190)));
extern volatile uint32_t        CNSTATBCLR __attribute__((section("sfrs"),address(0xBF886194)));
extern volatile uint32_t        CNSTATBSET __attribute__((section("sfrs"),address(0xBF886198)));
extern volatile uint32_t        CNSTATBINV __attribute__((section("sfrs"),address(0xBF88619C)));
#define ANSELC ANSELC
extern volatile uint32_t   ANSELC __attribute__((section("sfrs"), address(0xBF886200)));
typedef union {
  struct {
    uint32_t ANSC0:1;
    uint32_t ANSC1:1;
    uint32_t ANSC2:1;
    uint32_t ANSC3:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELCbits_t;
extern volatile __ANSELCbits_t ANSELCbits __asm__ ("ANSELC") __attribute__((section("sfrs"), address(0xBF886200)));
extern volatile uint32_t        ANSELCCLR __attribute__((section("sfrs"),address(0xBF886204)));
extern volatile uint32_t        ANSELCSET __attribute__((section("sfrs"),address(0xBF886208)));
extern volatile uint32_t        ANSELCINV __attribute__((section("sfrs"),address(0xBF88620C)));
#define TRISC TRISC
extern volatile uint32_t   TRISC __attribute__((section("sfrs"), address(0xBF886210)));
typedef union {
  struct {
    uint32_t TRISC0:1;
    uint32_t TRISC1:1;
    uint32_t TRISC2:1;
    uint32_t TRISC3:1;
    uint32_t TRISC4:1;
    uint32_t TRISC5:1;
    uint32_t TRISC6:1;
    uint32_t TRISC7:1;
    uint32_t TRISC8:1;
    uint32_t TRISC9:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISCbits_t;
extern volatile __TRISCbits_t TRISCbits __asm__ ("TRISC") __attribute__((section("sfrs"), address(0xBF886210)));
extern volatile uint32_t        TRISCCLR __attribute__((section("sfrs"),address(0xBF886214)));
extern volatile uint32_t        TRISCSET __attribute__((section("sfrs"),address(0xBF886218)));
extern volatile uint32_t        TRISCINV __attribute__((section("sfrs"),address(0xBF88621C)));
#define PORTC PORTC
extern volatile uint32_t   PORTC __attribute__((section("sfrs"), address(0xBF886220)));
typedef union {
  struct {
    uint32_t RC0:1;
    uint32_t RC1:1;
    uint32_t RC2:1;
    uint32_t RC3:1;
    uint32_t RC4:1;
    uint32_t RC5:1;
    uint32_t RC6:1;
    uint32_t RC7:1;
    uint32_t RC8:1;
    uint32_t RC9:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTCbits_t;
extern volatile __PORTCbits_t PORTCbits __asm__ ("PORTC") __attribute__((section("sfrs"), address(0xBF886220)));
extern volatile uint32_t        PORTCCLR __attribute__((section("sfrs"),address(0xBF886224)));
extern volatile uint32_t        PORTCSET __attribute__((section("sfrs"),address(0xBF886228)));
extern volatile uint32_t        PORTCINV __attribute__((section("sfrs"),address(0xBF88622C)));
#define LATC LATC
extern volatile uint32_t   LATC __attribute__((section("sfrs"), address(0xBF886230)));
typedef union {
  struct {
    uint32_t LATC0:1;
    uint32_t LATC1:1;
    uint32_t LATC2:1;
    uint32_t LATC3:1;
    uint32_t LATC4:1;
    uint32_t LATC5:1;
    uint32_t LATC6:1;
    uint32_t LATC7:1;
    uint32_t LATC8:1;
    uint32_t LATC9:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATCbits_t;
extern volatile __LATCbits_t LATCbits __asm__ ("LATC") __attribute__((section("sfrs"), address(0xBF886230)));
extern volatile uint32_t        LATCCLR __attribute__((section("sfrs"),address(0xBF886234)));
extern volatile uint32_t        LATCSET __attribute__((section("sfrs"),address(0xBF886238)));
extern volatile uint32_t        LATCINV __attribute__((section("sfrs"),address(0xBF88623C)));
#define ODCC ODCC
extern volatile uint32_t   ODCC __attribute__((section("sfrs"), address(0xBF886240)));
typedef union {
  struct {
    uint32_t ODCC0:1;
    uint32_t ODCC1:1;
    uint32_t ODCC2:1;
    uint32_t ODCC3:1;
    uint32_t ODCC4:1;
    uint32_t ODCC5:1;
    uint32_t ODCC6:1;
    uint32_t ODCC7:1;
    uint32_t ODCC8:1;
    uint32_t ODCC9:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCCbits_t;
extern volatile __ODCCbits_t ODCCbits __asm__ ("ODCC") __attribute__((section("sfrs"), address(0xBF886240)));
extern volatile uint32_t        ODCCCLR __attribute__((section("sfrs"),address(0xBF886244)));
extern volatile uint32_t        ODCCSET __attribute__((section("sfrs"),address(0xBF886248)));
extern volatile uint32_t        ODCCINV __attribute__((section("sfrs"),address(0xBF88624C)));
#define CNPUC CNPUC
extern volatile uint32_t   CNPUC __attribute__((section("sfrs"), address(0xBF886250)));
typedef union {
  struct {
    uint32_t CNPUC0:1;
    uint32_t CNPUC1:1;
    uint32_t CNPUC2:1;
    uint32_t CNPUC3:1;
    uint32_t CNPUC4:1;
    uint32_t CNPUC5:1;
    uint32_t CNPUC6:1;
    uint32_t CNPUC7:1;
    uint32_t CNPUC8:1;
    uint32_t CNPUC9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUCbits_t;
extern volatile __CNPUCbits_t CNPUCbits __asm__ ("CNPUC") __attribute__((section("sfrs"), address(0xBF886250)));
extern volatile uint32_t        CNPUCCLR __attribute__((section("sfrs"),address(0xBF886254)));
extern volatile uint32_t        CNPUCSET __attribute__((section("sfrs"),address(0xBF886258)));
extern volatile uint32_t        CNPUCINV __attribute__((section("sfrs"),address(0xBF88625C)));
#define CNPDC CNPDC
extern volatile uint32_t   CNPDC __attribute__((section("sfrs"), address(0xBF886260)));
typedef union {
  struct {
    uint32_t CNPDC0:1;
    uint32_t CNPDC1:1;
    uint32_t CNPDC2:1;
    uint32_t CNPDC3:1;
    uint32_t CNPDC4:1;
    uint32_t CNPDC5:1;
    uint32_t CNPDC6:1;
    uint32_t CNPDC7:1;
    uint32_t CNPDC8:1;
    uint32_t CNPDC9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDCbits_t;
extern volatile __CNPDCbits_t CNPDCbits __asm__ ("CNPDC") __attribute__((section("sfrs"), address(0xBF886260)));
extern volatile uint32_t        CNPDCCLR __attribute__((section("sfrs"),address(0xBF886264)));
extern volatile uint32_t        CNPDCSET __attribute__((section("sfrs"),address(0xBF886268)));
extern volatile uint32_t        CNPDCINV __attribute__((section("sfrs"),address(0xBF88626C)));
#define CNCONC CNCONC
extern volatile uint32_t   CNCONC __attribute__((section("sfrs"), address(0xBF886270)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONCbits_t;
extern volatile __CNCONCbits_t CNCONCbits __asm__ ("CNCONC") __attribute__((section("sfrs"), address(0xBF886270)));
extern volatile uint32_t        CNCONCCLR __attribute__((section("sfrs"),address(0xBF886274)));
extern volatile uint32_t        CNCONCSET __attribute__((section("sfrs"),address(0xBF886278)));
extern volatile uint32_t        CNCONCINV __attribute__((section("sfrs"),address(0xBF88627C)));
#define CNENC CNENC
extern volatile uint32_t   CNENC __attribute__((section("sfrs"), address(0xBF886280)));
typedef union {
  struct {
    uint32_t CNIEC0:1;
    uint32_t CNIEC1:1;
    uint32_t CNIEC2:1;
    uint32_t CNIEC3:1;
    uint32_t CNIEC4:1;
    uint32_t CNIEC5:1;
    uint32_t CNIEC6:1;
    uint32_t CNIEC7:1;
    uint32_t CNIEC8:1;
    uint32_t CNIEC9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENCbits_t;
extern volatile __CNENCbits_t CNENCbits __asm__ ("CNENC") __attribute__((section("sfrs"), address(0xBF886280)));
extern volatile uint32_t        CNENCCLR __attribute__((section("sfrs"),address(0xBF886284)));
extern volatile uint32_t        CNENCSET __attribute__((section("sfrs"),address(0xBF886288)));
extern volatile uint32_t        CNENCINV __attribute__((section("sfrs"),address(0xBF88628C)));
#define CNSTATC CNSTATC
extern volatile uint32_t   CNSTATC __attribute__((section("sfrs"), address(0xBF886290)));
typedef union {
  struct {
    uint32_t CNSTATC0:1;
    uint32_t CNSTATC1:1;
    uint32_t CNSTATC2:1;
    uint32_t CNSTATC3:1;
    uint32_t CNSTATC4:1;
    uint32_t CNSTATC5:1;
    uint32_t CNSTATC6:1;
    uint32_t CNSTATC7:1;
    uint32_t CNSTATC8:1;
    uint32_t CNSTATC9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATCbits_t;
extern volatile __CNSTATCbits_t CNSTATCbits __asm__ ("CNSTATC") __attribute__((section("sfrs"), address(0xBF886290)));
extern volatile uint32_t        CNSTATCCLR __attribute__((section("sfrs"),address(0xBF886294)));
extern volatile uint32_t        CNSTATCSET __attribute__((section("sfrs"),address(0xBF886298)));
extern volatile uint32_t        CNSTATCINV __attribute__((section("sfrs"),address(0xBF88629C)));
#define DEVCFG3 DEVCFG3
extern volatile uint32_t   DEVCFG3 __attribute__((section("sfrs"), address(0xBFC02FF0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :6;
    uint32_t AI2C1:1;
    uint32_t AI2C2:1;
    uint32_t :4;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG3bits_t;
extern volatile __DEVCFG3bits_t DEVCFG3bits __asm__ ("DEVCFG3") __attribute__((section("sfrs"), address(0xBFC02FF0)));
#define DEVCFG2 DEVCFG2
extern volatile uint32_t   DEVCFG2 __attribute__((section("sfrs"), address(0xBFC02FF4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLMUL:3;
    uint32_t FPLLICLK:1;
    uint32_t UPLLIDIV:3;
    uint32_t :4;
    uint32_t UPLLEN:1;
    uint32_t FPLLODIV:3;
    uint32_t :1;
    uint32_t BOREN:1;
    uint32_t VBATBOREN:1;
    uint32_t :1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG2bits_t;
extern volatile __DEVCFG2bits_t DEVCFG2bits __asm__ ("DEVCFG2") __attribute__((section("sfrs"), address(0xBFC02FF4)));
#define DEVCFG1 DEVCFG1
extern volatile uint32_t   DEVCFG1 __attribute__((section("sfrs"), address(0xBFC02FF8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t :2;
    uint32_t FSOSCEN:1;
    uint32_t :1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :1;
    uint32_t FPBDIV:2;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG1bits_t;
extern volatile __DEVCFG1bits_t DEVCFG1bits __asm__ ("DEVCFG1") __attribute__((section("sfrs"), address(0xBFC02FF8)));
#define DEVCFG0 DEVCFG0
extern volatile uint32_t   DEVCFG0 __attribute__((section("sfrs"), address(0xBFC02FFC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t :7;
    uint32_t PWP:8;
    uint32_t :3;
    uint32_t SMCLR:1;
    uint32_t BWP:1;
    uint32_t :3;
    uint32_t CP:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG0bits_t;
